---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookAlt
source: html/7b5d7fb6-a0d6-f3ea-0155-e1f9a490c1f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookAlt Property

"Start Hook Angle Alternating"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanhookAlt { get; }
```